src/Catalogs/SSL_IT_ПодключаемыеОбработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>SSL_IT_ПодключаемыеОбработки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расположение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.SSL_IT_ВариантыРасположенияОбработок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаМетаданные</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаОбработку</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/SSL_IT_ВариантыРасположенияОбработок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>SSL_IT_ВариантыРасположенияОбработок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Конфигурация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Справочник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Диск</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/SSL_IT_ПодключаемыеОбработки/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработкаСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьОтображениеЭлементовФормы();	
	
КонецПроцедуры

&НаКлиенте
Процедура РасположениеПриИзменении(Элемент)
	
	ОбновитьОтображениеЭлементовФормы();		
	
КонецПроцедуры

&НаКлиенте
Процедура ПолноеИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбработчикЗавершения = Новый ОписаниеОповещения("ПолноеИмяФайлаЗавершениеВыбора", ЭтаФорма);
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.Фильтр = НСтр("ru = 'Обработка'; en = 'Processing'") + "(*.epf)|*.epf";
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите файл обработки";
	ДиалогОткрытияФайла.Показать(ОбработчикЗавершения);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаКомандФормы

&НаКлиенте
Процедура СформироватьКлюч(Команда)
	
	КлючРодителя = ПолучитьКлючРодителя();
	КлючЭлемента = SSL_IT_СтроковыеФункцииКлиентСервер.ПолучитьКлючПоСтроке(Объект.Наименование);
	
	Если ПустаяСтрока(КлючРодителя) Тогда 
		Объект.Ключ = КлючЭлемента;
	Иначе
		Объект.Ключ = СтрШаблон("%1_%2", КлючРодителя, КлючЭлемента);
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьОтображениеЭлементовФормы()
	
	Элементы.СсылкаНаМетаданные.Видимость = 
		(Объект.Расположение = ПредопределенноеЗначение("Перечисление.SSL_IT_ВариантыРасположенияОбработок.Конфигурация"));
	
	Элементы.СсылкаНаОбработку.Видимость = 
		(Объект.Расположение = ПредопределенноеЗначение("Перечисление.SSL_IT_ВариантыРасположенияОбработок.Справочник"));
		
	Элементы.ПолноеИмяФайла.Видимость = 
		(Объект.Расположение = ПредопределенноеЗначение("Перечисление.SSL_IT_ВариантыРасположенияОбработок.Диск"));	
		
КонецПроцедуры	

&НаКлиенте
Процедура ПолноеИмяФайлаЗавершениеВыбора(МассивФайлов, ДополнительныеПараметры) Экспорт
	
	Если МассивФайлов <> Неопределено 
		И МассивФайлов.Количество() > 0 Тогда 
		Модифицированность = Истина;
		Объект.ПолноеИмяФайла = МассивФайлов.Получить(0);	
	КонецЕсли;	
	
КонецПроцедуры	

&НаСервере
Функция ПолучитьКлючРодителя()
	
	Возврат Объект.Родитель.Ключ;
	
КонецФункции	

#КонецОбласти
